const quizData = [
    {
        question: "1-савол. Ходимларни  меҳнат муҳофазаси бўйича ўқитиш ва билимини синовдан ўтказиш қайси меъёрий хужжат асосида ташкил этилади?",
        answers: [
            { text: "НБТ-313 Низоми", correct: false },
            { text: "ССБТ", correct: false},
            { text: "меҳнат шартномаси", correct: false },
            { text: "НБТ-312 Низоми", correct: true}
        ]
    },
    {
        question: "2-савол. Диэлектрик кўлкоп қанча кучланишда  лабаратория синовидан ўтказилади ?",
        answers: [
            { text: "6 кВ", correct: true },
            { text: "5 кВ", correct: false },
            { text: "10 кВ", correct: false },
            { text: "9 кВ", correct: false }
        ]
    },
    {
        question: "3-савол. 1000 В гача бўлган кучланишларда кўшимча ҳимоя воситаларига нималар киради?",
        answers: [
            { text: "диэлектрик кўлкоп, диэлектрик калиш, штанга, ерга улагичлар", correct: false},
            { text: "диэлектрик кўлкоп, изоляцияловчи ва электр ўлчовчи қисқичлар, кучланиш кўрсаткичлари", correct: false },
            { text: "диэлектрик калиш, диэлектрик гилам, кўчма ерга улагич, изоляцияловчи таглик ва копламалар, тўсиқловчи қурилмалар, хавфсизлик плакатлари ", correct: true },
            { text: "УВН, хавфсизлик плакатлари, диэлектрик кўлкоп, тирнок (когти)", correct: false }
        ]
    },
    {
        question: "4-савол. Меҳнатни муҳофаза қилиш тушунчасининг таърифи?",
        answers: [
            { text: "Меҳнатни муҳофаза қилиш – ходимга зарарли ишлаб чиқариш омили ва (ёки) хавфли ишлаб чиқариш омили таъсирининг олдини олиш ёки уни камайтириш, шунингдек ифлосланишлардан ҳимояланиш учун фойдаланиладиган техник воситалар ва бошқа воситалар", correct: false},
            { text: "Меҳнатни муҳофаза қилиш – бу тегишли қонун ва бошқа меъёрий ҳужжатлар асосида амал қилувчи, инсоннинг меҳнат жараёнидаги хавфсизлиги, сиҳат-саломатлиги ва иш қобилияти сақланишини таъминлашга қаратилган ижтимоий-иқтисодий, ташкилий, техникавий, санитария-гигиена ва даволаш-профилактика тадбирлари ҳамда воситалари тизимидан иборат", correct: false },
            { text: "Меҳнатни муҳофаза қилиш – тузилиши ёки вазифаси жиҳатидан ишлаб чиқариш биноси ва ишлаб чиқариш жараёни билан боғлиқ бўлган, ходимларга зарарли ишлаб чиқариш омили ва (ёки) хавфли ишлаб чиқариш омили таъсирининг олдини олиш ёки уни камайтириш, шунингдек ифлосланишлардан ҳимоя қилиш учун мўлжалланган техник воситалар ва бошқа воситалар", correct: false },
            { text: "Меҳнатни муҳофаза қилиш – меҳнат жараёнида инсоннинг хавфсизлигини, ҳаёти ва соғлиғи, иш қобилияти сақланишини таъминлашга доир ҳуқуқий, ижтимоий-иқтисодий, ташкилий, техникавий, санитария-гигиена, даволаш-профилактика, реабилитация тадбирлари ҳамда воситалари тизими", correct: true }
        ]
    },
    {
        question: "5-савол. Ходим қайси ҳолларда ишдан четлатилиши (ишга қўйилмаслиги) мумкин? ",
        answers: [
            { text: "Бевосита раҳбарини топширигини бажармаганда", correct: false},
            { text: "Меҳнат интизомини бузиб иш жойини ташлаб кетганда.", correct: false },
            { text: "*Ишда спирт ичимлиги, токсик моддаларни истеъмол қилганда, тиббий кўрикдан ўтмаганда ва тиббиёт ходимлари тавсияномаси бажарилмаганда.", correct: true },
            { text: "Кундалик режалаштирилган топширикни бажармаганда.", correct: false }
        ]
    },
    {
        question: "6-савол. Ўзбекистон Республикасининг “Меҳнатни муҳофаза қилиш тўғрисида”ги (Янги таҳрири) қонуни қачон қабул қилинган? ",
        answers: [
            { text: "Сенат томонидан 2016 йил 29 июнда маъқулланиб, 2016 йил 28 сентябрда эълон қилинган", correct: false},
            { text: "Қонунчилик палатаси томонидан 2016 йил 10 мартда қабул қилинган, Сенат томонидан 2016 йил 25 августда маъқулланган, 2016 йил 22 сентябрда ЎРҚ-410-сон билан тасдиқланган.", correct: true },
            { text: "06.05.1993 й. № 839-XII", correct: false },
            { text: "Қонунчилик палатаси томонидан 2016 йил 28 сентябрь куни қабул қилиниб, 2016 йил 29 сентябрь куни эълон қилинган.", correct: false }
        ]
    },
    {
        question: "7-савол. Хизмат кўрсатиш, синов ўтказиш, қурилма ва ускуналарни созлаш ва таъмирлаш ишлари ва ўта хавфли ишлар билан боғлиқ бўлмаган шахсларни қайси йўл-йўриқдан ўтказиш шарт эмас: ",
        answers: [
            { text: "кириш", correct: false},
            { text: "кириш ва навбатдан ташқари йўл-йўриқ", correct: false},
            { text: "навбатдан ташқари йўл-йўриқ", correct: false },
            { text: "бирламчи ва даврий йўл-йўриқ", correct: true }
        ]
    },
    {
        question: "8-савол. Билимларни текшириш қайси турларга бўлинади:",
        answers: [
            { text: "бирламчи, даврий ва навбатдан ташқари", correct: true},
            { text: "иккиламчи, режадан ташқари", correct: false},
            { text: "режа асосида, иккиламчи, режадан ташқари.", correct: false },
            { text: "режа асосида, режадан ташқари.", correct: false }
        ]
    },
    {
        question: "9-савол. Шахсий ҳимоя воситалари таърифи?",
        answers: [
            { text: "Шахсий ҳимоя воситалари – ходимга касбга оид меҳнат қобилиятини вақтинча ёхуд турғун йўқотишига сабаб бўлган ўткир ёки сурункали касалликлардан ҳимоя қилиш учун бериладиган махсус кийим-бош, махсус пойабзал.", correct: false},
            { text: "Шахсий ҳимоя воситалари – ходимга маҳсулот ишлаб чиқариш, хом ашёни қайта ишлаш, ишлар бажариш, хизматлар кўрсатиш чоғида бериладиган махсус кийим-бош.", correct: false},
            { text: "Шахсий ҳимоя воситалари – ходимга зарарли ишлаб чиқариш омили ва (ёки) хавфли ишлаб чиқариш омили таъсирининг олдини олиш ёки уни камайтириш, шунингдек ифлосланишлардан ҳимояланиш учун фойдаланиладиган техник воситалар ва бошқа воситалар", correct: true },
            { text: "Давлат ва хўжалик бошқаруви органлари ҳамда маҳаллий давлат ҳокимияти органлари келишиб ишлаб чиқган нормативлар асосида иш берувчи томонидан тақдим этиладиган воситалар.", correct: false }
        ]
    },
    {
        question: "10-савол. Бекат йўлларида узиб қўйилган вагонлар орасидаги масофа неча метрдан кам бўлмаганда ўтишга рухсат этилади?",
        answers: [
            { text: "20 метр ", correct: false},
            { text: "10 метр", correct: true},
            { text: "5 метр ", correct: false },
            { text: "15 метр", correct: false }
        ]
    },
    {
        question: "11-савол. Хавфли ишлаб чиқариш объектларини идентификациялаш ким томонидан амалга оширилади?",
        answers: [
            { text: "Транспорт вазирлиги хузуридаги инспекция", correct: false},
            { text: "Хавфли ишлаб чиқариш объектидан фойдаланаётган ташкилот.", correct: false},
            { text: "Саноат хавфсизлиги давлат қўмитаси", correct: false },
            { text: "Саноат хавфсизлиги соҳасида аккредитациядан ўтган эксперт ташкилоти.", correct: true }
        ]
    },
    {
        question: "12-савол. Диэлектрик қўлқопларнинг синов муддати.",
        answers: [
            { text: "6 ойда 1 марта", correct: true},
            { text: "3 ойда 1 марта", correct: false},
            { text: "12 ойда 1 марта", correct: false },
            { text: "24 ойда 1 марта", correct: false }
        ]
    },
    {
        question: "13-савол. Кириш йўл-йўриғини ўтказиш мақсади:",
        answers: [
            { text: "ходимларни асосий ва бошқа кўпинча бажарадиган ишларни хавфсиз бажариш бўйича билимини янгилаш.", correct: false},
            { text: "ходим томонидан билим ва амалий қобилиятни ўзлаштириши.", correct: false},
            { text: "иш шароитлари, ички меҳнат тартиби қоидалари ва меҳнат муҳофазаси бўйича умумий ҳолати билан таништириш.", correct: true },
            { text: "белгиланган иш жойида ишлаб чиқариш ҳолати ва ишни хавфсиз усуллари билан таништириш.", correct: false }
        ]
    },
    {
        question: "14-савол. Ишлаб чиқаришда бахтсиз ҳодисаларни текшириш ва ҳисобга олишда қандай ҳужжат  тузилади?",
        answers: [
            { text: "Баённома ва буйруқ", correct: false},
            { text: "Н-1 шакли махсус далолатномаси", correct: true},
            { text: "Ташкилот буйруғи", correct: false},
            { text: "Баённома", correct: false }
        ]
    },
    {
        question: "15-савол. Изоляцияланган отвертка ва омбурлар қанча вақтда лаборатория синовидан ўтказилади ва қанча кучланиш берилади?",
        answers: [
            { text: "1 йилда бир маротаба 2 кВ кучланиш берилади", correct: true},
            { text: "6 ойда бир маротаба 2 кВ кучланиш берилади", correct: false},
            { text: "1 йилда бир маротаба 1 кВ кучланиш берилади", correct: false },
            { text: "хар ойда бир маротаба 380 вольт кучланиш берилади", correct: false }
        ]
    },
    {
        question: "16-савол. Бирламчи йўл-йўриқни ўтказиш мақсади: ",
        answers: [
            { text: "ходим томонидан билим ва амалий қобилиятни ўзлаштириши.", correct: false},
            { text: "иш шароитлари, ички меҳнат тартиби қоидалари ва меҳнат муҳофазаси бўйича умумий ҳолати билан таништириш. ", correct: false},
            { text: "белгиланган иш жойида ишлаб чиқариш ҳолати ва ишни хавфсиз усуллари билан таништириш.", correct: true },
            { text: "ходимларни асосий ва бошқа кўпинча бажарадиган ишларни хавфсиз бажариш бўйича билимини янгилаш.", correct: false }
        ]
    },
    {
        question: "17-савол. Ергa улaнгaн элeктр жиҳoзлaридa ергa улaш сими узилгaн бўлсa нимa қилиш зaрур?",
        answers: [
            { text: "Мeтaллсимoн қисмлaргa тeгмaсдaн ишни дaвoм қилдириш кeрaк", correct: false},
            { text: "Aлoҳидa эҳтиётликни сaқлaб ишни дaвoм эттириш", correct: false},
            { text: "Бир кунгa ишни тўxтaтиш", correct: false },
            { text: "Стaнoкни тўxтaтиш вa нaвбaтчи элeктрoмoнтeрни чaқириш", correct: true }
        ]
    },
    {
        question: "18-савол. 15 ёшдан 16 ёшгача бўлган ишчиларнинг иш вақтининг давомийлиги неча соат этиб белгиланган",
        answers: [
            { text: "ҳафтасига 36 соатдан ошмаслиги", correct: false},
            { text: "ҳафтасига 24 соатдан ошмаслиги", correct: true},
            { text: "ҳафтасига 26 соатдан ошмаслиги", correct: false },
            { text: "ҳафтасига 30 соатдан ошмаслиги", correct: false}
        ]
    },
    {
        question: "19-савол. Корхонада содир бўлган қайси бахтсиз ҳодисалар махсус текширув қилинади?",
        answers: [
            { text: "барча жавоблар тўғри", correct: true},
            { text: "ўлим билан тугаган бахтсиз ҳодисалар", correct: false},
            { text: "оғир тан жароҳати билан тугаган бахтсиз ҳодиса", correct: false },
            { text: "икки ёки ундан ортиқ ишчи билан жароҳатидан қатъий назар бўлган бахтсиз ҳодиса", correct: false}
        ]
    },
    {
        question: "20-савол. Меҳнатга лаёқатлилик йўқотилганда ногиронлик гуруҳини ким белгилайди?",
        answers: [
            { text: "ишчи", correct: false},
            { text: "иш берувчи", correct: false},
            { text: "маъмурият", correct: false },
            { text: "тиббий-меҳнат эксперти комиссияси (ВЭТК)", correct: true}
        ]
    },
    {
        question: "21-савол. Тунги вақтдаги ишнинг ҳар бир соати учун тўлов қандай амалга оширилади?",
        answers: [
            { text: "икки баробардан кам бўлмаган миқдорда", correct: false},
            { text: "бир ярим баробардан кам бўлмаган миқдорда ", correct: true},
            { text: "уч баробардан кам бўлмаган миқдорда", correct: false },
            { text: "беш баробардан кам бўлмаган миқдорда", correct: false}
        ]
    },
    {
        question: "22-савол. Кучланиши 1000 В дан юқори бўлган электр ўтказгичда қолган шахсни қутқариш учун нима қилиш керак?",
        answers: [
            { text: "санаб ўтилганларнинг барчаси", correct: true},
            { text: "тегишли кучланишга мўлжалланган диэлектрик қўлқоп ва ботинка, оператив штанга, гиламчалардан фойдаланиш керак", correct: false},
            { text: "коммутацион аппаратура ёрдамида дастгоҳ ёки қурилмани ўчириш зарур", correct: false },
            { text: "қуруқ ва изоляцияли болта ёрдамида жароҳатланган шахс тегиб турган симни кесиб ташлаш керак", correct: false}
        ]
    },
    {
        question: "23-савол. Электр ҳавфсизлиги бўйича II-V гуруҳига эга электротехник ходимларга санаб ўтилган талаблардан қайсилари қўйилади?",
        answers: [
            { text: "ўрта ёки ўрта-махсус маълумотга эга бўлиши", correct: false},
            { text: "ҳамма жавоблар тўғри ", correct: true},
            { text: "электротехник ходими сифатида ишлашга врачдан ҳулоса бўлган шахс ва 18 ёшга кирмаганларга электр қурилмаларда мустақил ишлашга рухсат этилмайди", correct: false },
            { text: "электр қурилмаларида ишлаш учун гувоҳномаси бўлиши ва назарий ҳамда амалий тайёргарликдан ўтиши шарт", correct: false}
        ]
    },
    {
        question: "24-савол. Қозонларга хизмат кўрсатувчи ходимлар учун наъмунавий қўлланма қайси хужжат асосида ишлаб чиқилади?",
        answers: [
            { text: "техник топшириқ ва лойиҳалар асосида", correct: false},
            { text: "меҳнат муҳофазаси қоидалари асосида", correct: false},
            { text: "тармоқ таъриф-малака маълумотномаси асосида", correct: false},
            { text: "заводнинг йиғиш ва ишлатиш қўлланмалари асосида", correct: true}
        ]
    },
    {
        question: "25-савол. Ишчининг иш вақтининг ўртача давомийлиги қанча?",
        answers: [
            { text: "ҳафтада 40 соат", correct: true},
            { text: "ҳафтада камида 42 соат", correct: false},
            { text: "ҳафтада камида 48 соат", correct: false },
            { text: "ҳафтада камида 45 соат", correct: false}
        ]
    },
    {
        question: "26-савол. Ҳар қандай краннинг асосий кўрсаткичлари нима ҳисобланади?",
        answers: [
            { text: "бурилиш даражаси", correct: false},
            { text: "техник узатма тури", correct: false},
            { text: "юк кўтариш қобилияти", correct: true },
            { text: "ўқ-ёйини ўлчами", correct: false}
        ]
    },
    {
        question: "27-савол. Н-1 форма акти ким томонидан тасдиқланади?",
        answers: [
            { text: "бахтсиз ходисани текшириш комиссия раиси томонидан", correct: false},
            { text: "бахтсиз ҳодиса юз берган корхона иш берувчиси томонидан", correct: true},
            { text: "жабрланувчи ишчи томонидан", correct: false },
            { text: "профсоюз комитети томонидан", correct: false}
        ]
    },
    {
        question: "28-савол. Даврий йўл-йўриқни ўтказиш мақсади:",
        answers: [
            { text: "иш шароитлари, ички меҳнат тартиби қоидалари ва меҳнат муҳофазаси бўйича умумий ҳолати билан таништириш.", correct: false},
            { text: "белгиланган иш жойида ишлаб чиқариш ҳолати ва ишни хавфсиз усуллари билан таништириш.", correct: false},
            { text: "ходим томонидан билим ва амалий қобилиятни ўзлаштириши.", correct: false},
            { text: "ходимларни асосий ва бошқа кўпинча бажарадиган ишларни хавфсиз бажариш бўйича билимини янгилаш.", correct: true}
        ]
    },
    {
        question: "29-савол. Қайси муддатда 3 босқичли назоратнинг 1-чи босқичи амалга оширилади?",
        answers: [
            { text: "хар куни (навбатчилик) иш бошлашдан олдин.", correct: true},
            { text: "ўн кунликда бир маротаба.", correct: false},
            { text: "икки ойда бир маротаба.", correct: false },
            { text: "хафтасига бир маротаба.", correct: false}
        ]
    },
    {
        question: "30-савол. Ўзбекистон Республикасининг “Меҳнатни муҳофаза қилиш тўғрисида”ги қонунининг мақсади нимадан иборат?",
        answers: [
            { text: "Таъсири ходимнинг касб касаллигига чалинишига олиб келиши мумкин бўлган сабабларни ўрганиш.", correct: false},
            { text: "Меҳнатни муҳофаза қилиш соҳасидаги муносабатларни тартибга солишдан иборат.", correct: true},
            { text: "Меҳнатни муҳофаза қилиш тўғрисидаги қонун ҳужжатларида назарда тутилган шартномаларни ўрганиш.", correct: false },
            { text: "Ходимнинг иш берувчининг ҳудудида ҳам, унинг ташқарисида ҳам ўз меҳнат вазифаларини бажариши билан боғлиқ ҳолатларини тартибга солиш.", correct: false}
        ]
    },
    {
        question: "31-савол. Меҳнат муҳофазаси бўйича вакиллар томонидан амалга ошириладиган назорат қайси назорат турига киради?",
        answers: [
            { text: "маъмурий-жамоавий.", correct: true},
            { text: "идоравий.", correct: false},
            { text: "тезкор.", correct: false },
            { text: "ҳамма жавоблар тўғри.", correct: false}
        ]
    },
    {
        question: "32-савол. Юк кўтариш кранларини  қанча вақтда тўлиқ теxник кўрикдан ўтказилади?",
        answers: [
            { text: "36 ойда 1 марта.", correct: true},
            { text: "24 ойда 1 марта.", correct: false},
            { text: "12 ойда 1 марта.", correct: false },
            { text: "6 ойда 1 марта.", correct: false}
        ]
    },
    {
        question: "33-савол. Иш вақтидан ташқари ишларнинг энг кўп муддати йилига қанча вақтдан ошмаслиги керак",
        answers: [
            { text: "140 соатдан.", correct: false},
            { text: "130 соатдан", correct: false},
            { text: "120 соатдан", correct: true},
            { text: "150 соатдан", correct: false}
        ]
    },
    {
        question: "34-савол. Бахтсиз ҳодиса рўй берганда Н-1 шакли далолатномаси неча нусхада тўлдирилади?",
        answers: [
            { text: "4 нусхада.", correct: false},
            { text: "3 нусхада", correct: true},
            { text: "7 нусхада", correct: false },
            { text: "5 нусхада", correct: false}
        ]
    },
    {
        question: "35-савол. Юк кўтариш кранлари илгагининг кўтариш қобилияти қанча юк кўтаришга мослашган бўлса илгаклар бемалол айланиб туриши шарт?",
        answers: [
            { text: "2500 кг дан ортиқ юк кўтаришга мослашган", correct: false},
            { text: "2000 кг дан ортиқ юк кўтаришга мослашган", correct: false},
            { text: "1000 кг дан ортиқ юк кўтаришга мослашган", correct: false },
            { text: "3000 кг дан  ортик  юк  кўтаришга  мослашган", correct: true}
        ]
    },
    {
        question: "36-савол. Қайси масофага контакт тармоғи ва ҳаво линиялари ток ўтказиш қисмларига яқинлашиш тақиқланади?",
        answers: [
            { text: "2 метрга яқин.", correct: true},
            { text: "1 метрга яқин.", correct: false},
            { text: "3 метрга яқин.", correct: false},
            { text: "4 метрга яқин.", correct: false}
        ]
    },
    {
        question: "37-савол. Уч босқичли назоратнинг 3-босқичи кимлар томонидан ўтказилади?",
        answers: [
            { text: "Корхона раҳбари, меҳнат муҳофазаси муҳандиси", correct: false},
            { text: "Корхона раҳбарияти, меҳнат муҳофазаси муҳандиси ва касаба уюшмаси қўмитаси ", correct: true},
            { text: "Меҳнат муҳофазаси муҳандиси, меҳнат муҳофазаси вакили ва касаба уюшмаси қўмитаси", correct: false},
            { text: "Ёнғин хавфсизлиги вакили, меҳнат муҳофазаси муҳандиси", correct: false}
        ]
    },
    {
        question: "38-савол. Юк илдириш мосламалари қанча вақт оралиғида кўрикдан ўтказилади?",
        answers: [
            { text: "турига қараб ҳар 6 ойда.", correct: false},
            { text: "турига қараб ҳар 30 кунда.", correct: false},
            { text: "турига қараб ҳар 10, 15, 30 кунларда.", correct: true },
            { text: "турига қараб ҳар йили бир марта.", correct: false}
        ]
    },
    {
        question: "39-савол. Темир йўл яқинида ҳаракатланаётганда, махсус йўллар йўқ бўлган ҳолатларда неча градус бурчак остида темир йўлни кесиб ўтиш лозим ?",
        answers: [
            { text: "икки томонга қараб, поездар харакати йўқ пайтда 90 градус бурчак остида", correct: true},
            { text: "поезд йўқ бўлган вақтда хохлаган бурчак остида", correct: false},
            { text: "45 градус", correct: false},
            { text: "ўтиш таъқиқланади", correct: false}
        ]
    },
    {
        question: "40-савол.  Юк кўтариш кранлари қанча вақтда қисман техник кўрикдан ўтказилади?",
        answers: [
            { text: "6 oйда", correct: false},
            { text: "3 йилда", correct: false},
            { text: "5 йилда", correct: false},
            { text: "1 йилда", correct: true}
        ]
    },
    {
        question: "41-савол.  Тунги вақт деб нимага айтилади, тунги ишнинг давомийлиги қандай?",
        answers: [
            { text: "20:00 дан 08:00 гача", correct: false},
            { text: "22:00 дан 06:00 гача", correct: true},
            { text: "22:00 дан 08:00 гача", correct: false},
            { text: "00:00 дан 06:00 гача", correct: false}
        ]
    },
    {
        question: "42-савол.  Элeктр жиҳoзлaрдaги ёнғинни ўчиришдa қaйси мaркaдaги ўт ўчиргич вoсoтaсидaн фoйдaлaнилaди?",
        answers: [
            { text: "OУ-2, 5, 10", correct: true},
            { text: "OП-М", correct: false},
            { text: "OПX-10", correct: false},
            { text: "OВП-5", correct: false}
        ]
    },
    {
        question: "43-савол.  Юк кўтариш кранларининг иши қайси ҳoлатларда тўхтатилади?",
        answers: [
            { text: "юк илдирувчи томонидан тўхталади.", correct: false},
            { text: "Арқoн (трoсс) қисилиб қoлганида, юк илиш вoситалари шикасланганда, бахтсиз ҳoдисалар бўлганда, электр ва хавфсизлик ускуналарида нoсoзликлар аниқланганда ҳамда бoшқа авария ҳолатларида.", correct: true},
            { text: "Арқoн (трoсс) мойланмаганида, юк илиш вoситалари кўрикдан ўтказилмаганида, бахтсиз ҳoдисалар билан таништиришда, электр ва хавфсизлик ускуналарида нoсoзликлар аниқланмаган.", correct: false},
            { text: "Юкни бир жoйдан иккинши жoйга oлганда грейфернинг юк кўтариш қoбилияти шу юкни синoв йўли билан тoртиб кўриб аниқланади.", correct: false}
        ]
    },
    {
        question: "44-савол.  Юк кўтариш кранлари маълумот тахтачасида қандай маълумотлар бўлиши керак?",
        answers: [
            { text: "Юк кўтариш қoбилияти, рўйхат ва завод рақами, тўлиқ техник кўрикдан ўтказилган сана. ", correct: false},
            { text: "Юк кўтариш крани тури, тўлиқ техник кўрикдан ўтказилган ва кейинги ўтказиладиган сана. ", correct: false},
            { text: "Юк кўтариш крани тури, юк кўтариш қoбиляти, рўйхат ва завод рақами, тўлиқ техник кўрикдан ўтказилган ва кейинги ўтказиладиган сана. ", correct: true},
            { text: "Юк кўтариш крани рўйхат ва ишлаб чиқарган завод номи, тўлиқ техник кўрикдан ўтказилган сана.", correct: false}
        ]
    },
    {
        question: "45-савол.  Юк кўтариш кранлари билан ишлашда қайси ҳолларда қўшимча юк илдирувчи тайинланади?",
        answers: [
            { text: "юк илдиувчи талаб этганида.", correct: false},
            { text: "қўшимча юклар қўшилганида.", correct: false},
            { text: "иш хажми кўпайганида.", correct: false},
            { text: "кран машинистига юк кўринмаган ҳолларда.", correct: true}
        ]
    },
    {
        question: "46-савол.  Биринчи даражали куйишда қайси ҳоллар кузатилади?",
        answers: [
            { text: "тери қизаради,оғрик, пуфакчалар пайдо бўлади", correct: false},
            { text: "тери қизаради, шиш, ачишиш", correct: true},
            { text: "терининг бутунлиги бузилади, тери ва тери остида жойлашган юмшоқ тўкималар кўмирсимон ўзгаради", correct: false},
            { text: "тери бутунлиги бузилади, тери ва тери остида жойлашган юмшоқ туқималар ва суяк кўмирсимон ўзгаради", correct: false}
        ]
    },
    {
        question: "47-савол.  Ходим кайси холларда ишдан четлатилиши (куйилмаслиги ) мумкин?",
        answers: [
            { text: "Ишда спирт ичимлиги, токсик моддаларни истеъмол килганда, тиббий курикдан утмаганда ва тиббиёт ходимлари тавсияномаси бажарилмаганда. ", correct: true},
            { text: "Мехнат интизомини бузиб иш жойини ташлаб кетганда.", correct: false},
            { text: "Бевосита рахбарини топширигини бажармаганда.", correct: false},
            { text: "Кундалик режалаштирилган топширикни бажармаганда.", correct: false}
        ]
    },
    {
        question: "48-савол.  Юкори даражада хавф тугдирадиган ишларда мехнат килувчи ходимларни мехнатни мухофаза килиш буйича билимлари кайси муддатда синовдан утказилади?",
        answers: [
            { text: "Хар 3 йилда 1 марта.", correct: false},
            { text: "Хар 2 йилда 1 марта.", correct: false},
            { text: "Хар йили 1 марта.", correct: true},
            { text: "Хар олти ойда 1 марта.", correct: false}
        ]
    },
    {
        question: "49-савол.  Уч босқичли маъмурий-жамоатчилик назорати қайси меъёрий хужжат асосида ташкил этилади?",
        answers: [
            { text: "НБТ-312 Низоми", correct: false},
            { text: "НБТ-313 Низоми", correct: true},
            { text: "ССБТ", correct: false},
            { text: "Жамоа шартномаси", correct: false}
        ]
    },
    {
        question: "50-савол.  Меҳнат муҳофазаси бўйича маҳаллий йўриқнома ким томонидан ишлаб чиқилади?",
        answers: [
            { text: "цех бошлиғи томонидан", correct: true},
            { text: "меҳнат муҳофазаси муҳандиси томонидан ", correct: false},
            { text: "ишчи-ходим томонидан", correct: false},
            { text: "Иш берувчи белгилаган ходим томонидан", correct: false}
        ]
    },
    // Add more questions as needed
];

let currentQuestionIndex = 0;
let countcorrect = 0;

const questionContainer = document.getElementById('question-container');
const answerButtonsContainer = document.getElementById('answer-buttons');
const nextButton = document.getElementById('next-button');

function startQuiz() {
    currentQuestionIndex = 0;
    nextButton.classList.add('hide');
    showQuestion(quizData[currentQuestionIndex]);
}

function showQuestion(question) {
    questionContainer.innerText = question.question;
    resetAnswerButtons();

    question.answers.map((answer) => {
        const div = document.createElement('div')
        div.style.display = 'block'
        const button = document.createElement('button');
        button.innerText = answer.text;
        button.classList.add('btn');
        button.style.border = "solid 1px black"
        button.style.margin = '5px'
        div.appendChild(button)
        button.addEventListener('click', () => selectAnswer(answer));
        answerButtonsContainer.appendChild(div);

    });
}

function resetAnswerButtons() {
    while (answerButtonsContainer.firstChild) {
        answerButtonsContainer.removeChild(answerButtonsContainer.firstChild);
    }
    
}

function selectAnswer(answer) {
    const correct = answer.correct;
    if (correct == true) {
        alert("Javobingiz to'g'ri!")
        countcorrect += 1;
    }
    else if(correct == false) {
        for (const ans of quizData[currentQuestionIndex].answers) {
            if(ans.correct == true) {
                alert(`Javobingiz xato!  To'g'ri javob: ${ans.text}. Keyingi саволga o'ting.`)
            }
        }
    }
  

    // Disable answer buttons after selection
    answerButtonsContainer.childNodes.forEach(button => {
        button.disabled = true;
    });

    // Show the "Next" button
    nextButton.classList.remove('hide');
}

function nextQuestion() {
    currentQuestionIndex += 1;
    if (currentQuestionIndex < quizData.length) {
        showQuestion(quizData[currentQuestionIndex]);
        console.log(quizData[currentQuestionIndex]);
        nextButton.classList.add('hide');
    } else {
        const result = document.getElementById('result')
        // End of the quiz, display final score or completion message
        questionContainer.innerText = "Test yakunlandi!";
        nextButton.innerHTML = '';
        nextButton.className = '';
        result.innerHTML = `Natijani ko'rish`
        resetAnswerButtons();
    }
}

function result() {
    alert(`To'g'ri javoblar soni: ${countcorrect} ta !`)
}

// Start the quiz when the page loads
startQuiz();
